const genreMap: { [key: number]: string } = {
  // ✅ Movie Genres
  28: "أكشن",
  12: "مغامرة",
  16: "رسوم متحركة",
  35: "كوميديا",
  80: "جريمة",
  99: "وثائقي",
  18: "دراما",
  10751: "عائلي",
  14: "فانتازيا",
  36: "تاريخي",
  27: "رعب",
  10402: "موسيقى",
  9648: "غموض",
  10749: "رومانسي",
  878: "خيال علمي",
  10770: "تلفزيوني",
  53: "إثارة",
  10752: "حرب",
  37: "ويسترن",

  // ✅ TV Genres
  10759: "أكشن ومغامرة",
  10762: "أطفال",
  10763: "أخبار",
  10764: "واقعي",
  10765: "خيال علمي وفانتازيا",
  10766: "مسلسل يومي",
  10767: "توك شو",
  10768: "حرب وسياسة",
}

export default function getGenreNames(ids: number[]): string[] {
  return ids.map((id) => genreMap[id]);
}
