const genreMap: { [key: number]: string } = {
  // ✅ Movie Genres
  28: "حركة",
  12: "مغامرة",
  16: "رسوم متحركة",
  35: "كوميديا",
  80: "جريمة",
  99: "وثائقي",
  18: "دراما",
  10751: "عائلي",
  14: "فانتازيا",
  36: "تاريخ",
  27: "رعب",
  10402: "موسيقى",
  9648: "غموض",
  10749: "رومنسي",
  878: "خيال علمي",
  10770: "فيلم تلفازي",
  53: "إثارة",
  10752: "حرب",
  37: "غربي",

  // ✅ TV Genres
  10759: "حركة ومغامرة",
  10762: "أطفال",
  10763: "أخبار",
  10764: "واقع",
  10765: "خيال علمي وفانتازيا",
  10766: "أوبرا صابونية",
  10767: "حوار",
  10768: "حرب وسياسة"
}

export default function getGenreNames(ids: number[]): string[] {
  return ids.map((id) => genreMap[id]).filter(Boolean);
}
